///////////////////////////////////////////////////////////////////////////////
//
// Приложение генерации отчета об измененных объектах, переопределенных в расширении
//
// (с) BIA Technologies, LLC
//
///////////////////////////////////////////////////////////////////////////////

#Использовать "."

///////////////////////////////////////////////////////////////////////////////

Приложение = МенеджерПриложения.Инициализировать(ПараметрыПриложения);

Попытка
	
	Приложение.ЗавершитьРаботуПриложения(Приложение.ЗапуститьВыполнение());
	
Исключение
	
	Приложение.ЗавершитьРаботуПриложенияСОшибкой(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	
КонецПопытки;
